{
	"menu": {
		"overview": "Overview",
		"issuesAndBackground": "Background",
		"architecture": "Architecture",
		"achievements": "Achievements",
		"currentWorks": "Current Works",
		"future": "Future Prospects",
		"team": "About Us",
		"contact": "Contact📮"
	},
	"menuGuide": {
		"title": "Menu Button is Here!",
		"description": "You can switch languages from the button in the top right corner",
		"closeButton": "Got it"
	},
	"overview": "Future Artificial Intelligence Pillow (FAIP) is a next-generation AI pillow that leverages AI technology. It automatically adjusts to the optimal height for each individual user and facilitates breathing to provide high-quality sleep. We are building an unprecedented new 'sleep-supporting infrastructure'!",
	"issues_and_background_contents": [
		"Japan is a country where sleep deprivation is particularly serious among developed nations. According to a 2021 OECD (Organisation for Economic Co-operation and Development) survey, the average sleep duration of Japanese people is 7 hours and 22 minutes, which is the shortest among OECD member countries.",
		"[img:/compareSleepingHours.png]",
		"Sleep deprivation has negative effects on society as a whole, including decreased labor productivity and increased medical costs. To solve this problem, we developed an AI-powered pillow called 'FAIP'."
	],
	"architecture_contents": [
		"1. Load cells installed on all four sides of the pillow base measure the weight of the head and send it to a PC to be used as training data for deep learning. The center of gravity is then calculated using a weighted average, estimating the head position with nearly 100% accuracy.",
		"[img:/flowContent1.png]",
		"2. Air pressure sensors attached inside the airbags measure air pressure. The PC then executes inference processing using deep learning and performs PID control to reach the optimal air pressure level.",
		"[img:/flowContent2.png]",
		"3. The opening and closing of solenoid valves specifies which airbag to send air to.",
		"[img:/flowContent3.png]",
		"4. Air pressure is adjusted by an air pump for the specified airbag.",
		"[img:/flowContent4.png]"
	],
	"currentWork_headlines": {
		"heatmap": "Pressure Distribution Heatmap",
		"snoreDetection": "Snore Detection"
	},
	"currentWork_description": {
		"heatmap": "A system that estimates head position from pressure data and outputs a two-dimensional heatmap",
		"snoreDetection": "A system that detects snoring occurrence based on audio data during sleep"
	},
	"current_work_contents": [
		"We are currently developing a prototype of FAIP.",
		"Based on user feedback, we are improving functions and adding new features.",
		"We will continue research to provide a more comfortable sleep environment using AI technology."
	],
	"future_contents": [
		"We want to solve sleep deprivation by improving sleep quality using AI.",
		"We are confident that high-quality sleep can improve overall societal happiness through contributions such as improved labor productivity and reduced medical costs.",
		"**The sleep revolution through FAIP is an innovative solution that maximizes Japan's potential and realizes sustainable growth for both individuals and society. Through this technology, we will create a future where everyone can enjoy better sleep and the enriched life it brings.**"
	],
	"achievement_title_dcon": "National Institute of Technology Deep Learning Contest 2024 (DCON2024) 3rd Place",
	"achievement_text_dcon": [
		"Our project won 3rd place in the DCON2024 finals held in May 2024.",
		"DCON is a contest where participants propose business plans utilizing deep learning technology and compete based on their corporate valuation.",
		"After technical screening and final presentation evaluation by active investors, our work was valued at 350 million yen in corporate valuation."
	],
	"achievement_title_ssc": "Participation and Presentation at International Workshop Seating/Sitting Comfort",
	"achievement_text_ssc": [
		"We participated in and presented at the International Workshop Seating/Sitting Comfort held in October 2024.",
		"Due to its relevance to cushion products, we presented our research results on AI-powered pillows and attracted interest from many participants."
	],
	"achievement_title_jesk45": "Japan Ergonomics Society Kyushu-Okinawa Branch 45th Conference Excellence Award",
	"achievement_text_jesk45": [
		"We presented at the Japan Ergonomics Society Kyushu-Okinawa Branch 45th Conference held in November 2024 and received the Excellence in Presentation Award."
	],
	"achievement_title_jes66": "Exhibition at the 66th Conference of the Japan Ergonomics Society",
	"achievement_text_jes66": [
		"At the 66th Conference of the Japan Ergonomics Society held in November 2024, we exhibited our AI pillow as a representative manufacturing product from Kyushu."
	],
	"achievement_title_journal_article": "Scheduled Article Contribution to Academic Journal",
	"achievement_text_journal_article": "Our academic research has been recognized, and we plan to contribute an article titled \"Pillow Height Control System Using Artificial Intelligence\" about our AI pillow to an academic journal.",
	"footer": {
		"team_contents": [
			"We are a student team from Oita National College of Technology working on developing the AI pillow 'FAIP'.",
			"The name NeurestX embodies our vision.",
			"'Neuro' represents both neurons in AI neural networks and neurons in neuroscience, 'rest' means relaxation, and 'X' embodies our desire to open up unknown possibilities in sleep. The combination NeurestX represents our core vision of challenging the 'unknown possibilities of maximizing rest quality' using AI and neuroscience."
		],
		"contact": "✉️: sugarkouga0926@gmail.com"
	},
	"lang": "English",
	"switch": "日本語",
	"heatmapPage": {
		"heatmapHeadline": "Pressure Distribution Heatmap",
		"heatmapContents": [
			"This is a system that estimates head position based on data obtained from pressure sensors.",
			"This system visualizes pressure distribution as a two-dimensional heatmap, enabling visualization of the user's head position.",
			"The heatmap shows how much pressure is applied to which part of the pillow and can be used for real-time control of the AI pillow.",
			"[img:/currentWork/heatmapAnimation.gif]",
			"**Processing Flow**",
			"CSV data from four pressure sensors (top-left, top-right, bottom-left, bottom-right) is read to obtain pressure values from each sensor.",
			"Based on pressure values, the center position of the head is estimated using weighted averages.",
			"[img:/weightedAverage.png]",
			"Heatmap images generated based on the center position are saved frame by frame and output as an animated GIF."
		]
	},
	"snoreDetectionPage": {
		"snoreDetectionHeadline": "Snore Detection",
		"snoreDetectionContents": [
			"This is a system that detects snoring occurrence based on audio data during sleep.",
			"This system analyzes audio data obtained from microphones using machine learning models and statistical algorithms to identify snoring patterns.",
			"We aim to create a system for automatic adjustment of comfortable sleep environments and early disease detection just by sleeping.",
			"**Processing Flow**",
			"Audio captured by microphone is converted to mel-spectrogram and input to a CNN model.",
			"The CNN model is trained with binary cross-entropy loss and Adam optimizer, and uses the PELT algorithm to automatically identify the start and end of snoring.",
			"[img:/currentWork/snoreDetection.png]"
		]
	}
}
